# Массив клеток карты (порядок строго по ходу движения игрока влево от Старта).
BOARD = [
    'Старт',            # Индекс 0
    'Арена',            # Индекс 1
    'Медиа',            # Индекс 2
    'Тренировка',       # Индекс 3
    'Арена',            # Индекс 4
    'Random',           # Индекс 5
    'Арена',            # Индекс 6
    'Time out',         # Индекс 7
    'Арена',            # Индекс 8
    'Медиа',            # Индекс 9
    'Random',           # Индекс 10
    'Арена',            # Индекс 11
    'Тренировка',       # Индекс 12
    'Арена',            # Индекс 13
    'Допинг контроль',  # Индекс 14
    'Арена',            # Индекс 15
    'Матч',             # Индекс 16
    'Random',           # Индекс 17
    'Тренировка',       # Индекс 18
    'Медиа',            # Индекс 19
    'Арена',            # Индекс 20
    'Громкий трансфер', # Индекс 21
    'Арена',            # Индекс 22
    'Тренировка',       # Индекс 23
    'Медиа',            # Индекс 24
    'Арена',            # Индекс 25
    'Random',           # Индекс 26
    'Матч'              # Индекс 27
]

DEFAULT_BUY_PRICE = 12
DEFAULT_RENT_PRICE = 4

ARENA_PRICES = {
    index: {'buy_price': DEFAULT_BUY_PRICE, 'rent_price': DEFAULT_RENT_PRICE}
    for index, tile in enumerate(BOARD) if tile == 'Арена'
}